app/views/admin/alarm/alarms/_list.html.erb

INSERT INTO `alarms` (`name`, `time_gran`, `created_at`, `updated_at`) VALUES ('test', 60, '2017-09-13 15:27:00', '2017-09-13 15:27:00')
---
   <td class="center aligned"> <%= alarm.name %> </td>
   <td class="center aligned"> <%= alarm.created_at.strftime("%Y-%m-%d") %> </td>