app/controllers/admin/alarm/alarms_controller.rb

  def index
    @q = SearchParams.new(params[:search_params] || {})
    search_params = @q.attributes(self)
    @alarms = ::Alarm.default_where(search_params).order(id: :desc).page(params[:page]).per(20)
---
SELECT  `alarms`.* FROM `alarms` ORDER BY `alarms`.`id` DESC LIMIT 20 OFFSET 0

  def edit
  	@alarm = ::Alarm.find(params[:id])
---
SELECT  `alarms`.* FROM `alarms` WHERE `alarms`.`id` = 1 LIMIT 1

  def create
    ::Alarm.transaction do
      @alarm = ::Alarm.new(alarm_params)
      params[:alarm][:alarm_record].each do |index, spec|
        if spec[:kpi].present?
          @alarm.alarm_records.new(spec.permit!.merge(color:params[:jscolor]))
        end
      end
      @alarm.save
---
INSERT INTO `alarm_records` (`alarm_id`, `kpi`, `kpi_vc`, `kpi_vn`, `kpi_method`, `describe`, `color`, `created_at`, `updated_at`) VALUES (1, '客户数量', '2', '@@employee.all.size', 'a <= b', '客户数', 'AB2567', '2017-09-13 15:27:00', '2017-09-13 15:27:00')
INSERT INTO `alarms` (`name`, `time_gran`, `created_at`, `updated_at`) VALUES ('test', 60, '2017-09-13 15:27:00', '2017-09-13 15:27:00')

  def update
    TemporaryReport.transaction do
      @alarm = ::Alarm.find(params[:id])
      @alarm.update(alarm_params)
      params[:alarm][:alarm_record].each do |index, spec|
        spec.permit!
        if spec[:id].present?
          new_spec = AlarmRecord.find(spec[:id])
          new_spec.attributes =  spec.merge(color:params[:jscolor])
          new_spec.save
---
SELECT  `alarms`.* FROM `alarms` WHERE `alarms`.`id` = 1 LIMIT 1
SELECT  `alarm_records`.* FROM `alarm_records` WHERE `alarm_records`.`id` = 1 LIMIT 1
UPDATE `alarm_records` SET `kpi_method` = 'a.to_i <= b.to_i', `updated_at` = '2017-09-13 15:29:48' WHERE `alarm_records`.`id` = 1