app/controllers/admin/alarm/records_controller.rb

  def alarm_analysis
  	@alarm_record = AlarmRecord.find(params[:id])
    @alarm_details = @alarm_record.alarm_details.limit(10)&.order(id: :desc)
---
SELECT  `alarm_records`.* FROM `alarm_records` WHERE `alarm_records`.`id` = 1 LIMIT 1
SELECT  `alarm_details`.* FROM `alarm_details` WHERE `alarm_details`.`alarm_record_id` = 1 ORDER BY `alarm_details`.`id` DESC LIMIT 10

  def fast_find
    @alarm_record = AlarmRecord.find(params[:id])
---
SELECT  `alarm_records`.* FROM `alarm_records` WHERE `alarm_records`.`id` = 1 LIMIT 1