app/views/admin/alarm/records/_index.html.erb

                <span style="width: 120px;"><%= _.kpi %></span>
                <div class="floating ui label" style="background: #<%=_.color%>"><%= _.alarm_details.actived.size %></div>
---
SELECT COUNT(*) FROM `alarm_details` WHERE `alarm_details`.`alarm_record_id` = 1 AND `alarm_details`.`active` = 1